src/Reports/инкАУСНИнформацияДляФНС/инкАУСНИнформацияДляФНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>инкАУСНИнформацияДляФНС</name>
</mdclass:Report>

src/AccumulationRegisters/инкВычетыНДФЛ/инкВычетыНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>инкВычетыНДФЛ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаВычетаНДФЛ</name>
    <type>
      <types>EnumRef.инкГруппыВычетовПоНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВычетНДФЛ</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.инкИсточникиФинансирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/инкНачисления/инкНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>инкНачисления</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДетей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БольничныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Взносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВходитВФОТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВычетНДФЛ</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.инкОтпускРасчетПоСреднему</types>
      <types>DocumentRef.инкБольничныйЛистРасчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.инкДоходНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.инкИсточникиФинансирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериальнаяПомощь</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодДата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодДата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ст9ФЗ212</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФондТравматизма</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/инкАУСНИнформацияДляФНС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Организация Экспорт;		// Ссылка - Ссылка на справочник "Организации";
Перем Подразделение Экспорт;	// Ссылка - Ссылка на справочник "Подразделение";
Перем Сотрудники Экспорт; 		// Массив - Массив из справочников "Сотрудники";
Перем Дата1 Экспорт;			// Дата	- Дата1 (начало периода);
Перем Дата2 Экспорт;			// Дата - Дата2 (конец периода);

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область о // Инициализация:

// Процедура - Инициализация
//
Процедура Инициализация() Экспорт

	Организация = Неопределено;
	Подразделение = Неопределено;
	Сотрудники = Неопределено;        
	Дата1 = Неопределено;
	Дата2 = Неопределено;

КонецПроцедуры

#КонецОбласти  

#Область о // Сформировать табличные документы:

// Функция - Сформировать табличные документы
// 
// Возвращаемое значение:
//   - Структура - Табличные документы;
//
Функция СформироватьТабличныеДокументы() Экспорт 
	
	ИсходныеДанные = ПолучитьИсходныеДанные();
	
	ТабличныеДокументы = Новый Структура;
	ТабличныеДокументы.Вставить("ОтчетАУСНИнформацияДляФНС");
	
	ТабличныеДокументы.ОтчетАУСНИнформацияДляФНС = ПолучитьОтчетАУСНИнформацияДляФНС(ИсходныеДанные);
	
	Возврат ТабличныеДокументы;
	
КонецФункции    

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Исходные данные:

Функция ПолучитьИсходныеДанные()
	
	ИсходныеДанные = Новый Структура;

	ИсходныеДанные.Вставить("Дата1",Дата1);
	ИсходныеДанные.Вставить("Дата2",Дата2);

	ИсходныеДанные.Вставить("Сотрудники",Сотрудники);
	ИсходныеДанные.Вставить("СотрудникиТаблица",инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудников(ИсходныеДанные,Ложь));
	ИсходныеДанные.Вставить("НачисленияТаблица",ПолучитьНачисленияТаблица(ИсходныеДанные));
	ИсходныеДанные.Вставить("ВычетыТаблица",ПолучитьВычетыТаблица(ИсходныеДанные));
	
	Возврат ИсходныеДанные;
	
КонецФункции            

Функция ПолучитьВычетыТаблица(ИсходныеДанные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкВычетыНДФЛОбороты.Период КАК Период,
		|	инкВычетыНДФЛОбороты.Сотрудник КАК Сотрудник,
		|	инкВычетыНДФЛОбороты.ВычетНДФЛ КАК ВычетНДФЛ,
		|	инкВычетыНДФЛОбороты.СуммаВычетаОборот КАК СуммаВычетаОборот
		|ИЗ
		|	РегистрНакопления.инкВычетыНДФЛ.Обороты(&Дата1, &Дата2, Месяц, ) КАК инкВычетыНДФЛОбороты";
	
	Запрос.УстановитьПараметр("Дата1", ИсходныеДанные.Дата1);
	Запрос.УстановитьПараметр("Дата2", ИсходныеДанные.Дата2);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьНачисленияТаблица(ИсходныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкНачисленияОбороты.Сотрудник КАК Сотрудник,
		|	инкНачисленияОбороты.Период КАК Период,
		|	инкНачисленияОбороты.Начисление.ДоходНДФЛ КАК ДоходНДФЛ,
		|	инкНачисленияОбороты.Начисление.ДоходНДФЛ.Код КАК КодВыплаты,
		|	ВЫБОР
		|		КОГДА инкНачисленияОбороты.Сотрудник.Инвалид
		|			ТОГДА ""Инвалид""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СведенияОВычетах,
		|	ВЫБОР
		|		КОГДА инкНачисленияОбороты.Ст9ФЗ212
		|				ИЛИ инкНачисленияОбороты.МатериальнаяПомощь
		|			ТОГДА инкНачисленияОбороты.Начисление
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидВыплатыВычет,
		|	СУММА(инкНачисленияОбороты.СуммаНачисленияОборот + инкНачисленияОбороты.РайонныйКоэффициентОборот + инкНачисленияОбороты.СевернаяНадбавкаОборот) КАК СуммаВыплаты,
		|	СУММА(инкНачисленияОбороты.СуммаВычетаОборот) КАК ВыплатаВычетСумма
		|ИЗ
		|	РегистрНакопления.инкНачисления.Обороты(&Дата1, &Дата2, Месяц, Сотрудник В (&СотрудникиМассив)) КАК инкНачисленияОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	инкНачисленияОбороты.Сотрудник,
		|	инкНачисленияОбороты.Период,
		|	инкНачисленияОбороты.Начисление.ДоходНДФЛ,
		|	ВЫБОР
		|		КОГДА инкНачисленияОбороты.Ст9ФЗ212
		|				ИЛИ инкНачисленияОбороты.МатериальнаяПомощь
		|			ТОГДА инкНачисленияОбороты.Начисление
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	инкНачисленияОбороты.Начисление.ДоходНДФЛ.Код,
		|	ВЫБОР
		|		КОГДА инкНачисленияОбороты.Сотрудник.Инвалид
		|			ТОГДА ""Инвалид""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("СотрудникиМассив", ИсходныеДанные.Сотрудники);
	
	НачисленияТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат НачисленияТаблица;
	
КонецФункции

#КонецОбласти                

#Область о // Отчет по остатку отпусков: 

Функция ПолучитьОтчетАУСНИнформацияДляФНС(ИсходныеДанные)

	АУСНТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("МакетАУСН"); 
	
	Для каждого СотрудникСтрока Из ИсходныеДанные.СотрудникиТаблица Цикл
		
		ВывестиСведенияОРаботнике(СотрудникСтрока,Макет,АУСНТабличныйДокумент);
		ВывестиСведенияОДоходахИВычетах(СотрудникСтрока,ИсходныеДанные,Макет,АУСНТабличныйДокумент);
		
		ОбластьОтчет = Макет.ПолучитьОбласть("ТаблицаОтступ");
		АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  
		
		//АУСНТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат АУСНТабличныйДокумент;	
	
КонецФункции        

Процедура ВывестиСведенияОРаботнике(СотрудникСтрока,Макет,АУСНТабличныйДокумент)
	
	ОбластьОтчет = Макет.ПолучитьОбласть("СведенияОРаботникахШапка");
	АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  

	ОбластьОтчет = Макет.ПолучитьОбласть("СведенияОРаботникахСтрока");
	ЗаполнитьЗначенияСвойств(ОбластьОтчет.Параметры,СотрудникСтрока); 
	ОбластьОтчет.Параметры.ДокументСерияНомер = СотрудникСтрока.ДокументСерия
	                                          + " "
											  + СотрудникСтрока.ДокументНомер;
	АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  

	ОбластьОтчет = Макет.ПолучитьОбласть("ТаблицаОтступ");
	АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  
	
КонецПроцедуры

Процедура ВывестиСведенияОДоходахИВычетах(СотрудникСтрока,ИсходныеДанные,Макет,АУСНТабличныйДокумент)
	
	СтрокаПоиск = Новый	Структура;
	СтрокаПоиск.Вставить("Сотрудник",СотрудникСтрока.Сотрудник);

	НачисленияМассив = ИсходныеДанные.НачисленияТаблица.НайтиСтроки(СтрокаПоиск);

	Если НачисленияМассив.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	

	ОбластьОтчет = Макет.ПолучитьОбласть("СведенияОДаходахШапка");
	АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  
	
	Для каждого НачисленияСтрока Из НачисленияМассив Цикл
		
		ОбластьОтчет = Макет.ПолучитьОбласть("СведенияОДаходахСтрока");
		ЗаполнитьЗначенияСвойств(ОбластьОтчет.Параметры,НачисленияСтрока);    
		
		// Стандартные вычеты:
		ВычетыСтруктура = ПолучитьВычетыСтруктура(СотрудникСтрока,НачисленияСтрока,ИсходныеДанные);   
		Если ЗначениеЗаполнено(ВычетыСтруктура) Тогда
			ЗаполнитьЗначенияСвойств(ОбластьОтчет.Параметры,ВычетыСтруктура);	
		КонецЕсли;                 
		
		// Выплаты, не подлежащие обложению страховыми взносами:
		Если ЗначениеЗаполнено(НачисленияСтрока.ВидВыплатыВычет) Тогда
			ОбластьОтчет.Параметры.ВидВыплатыВычет = НачисленияСтрока.ВидВыплатыВычет;	  
			ОбластьОтчет.Параметры.КодВыплатыВычет = НачисленияСтрока.КодВыплаты;	  
			Если ОбластьОтчет.Параметры.ВыплатаВычетСумма = 0 Тогда
				ОбластьОтчет.Параметры.ВыплатаВычетСумма = НачисленияСтрока.СуммаВыплаты;	
			КонецЕсли;
		КонецЕсли;
		
		АУСНТабличныйДокумент.Вывести(ОбластьОтчет);  
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВычетыСтруктура(СотрудникСтрока,НачисленияСтрока,ИсходныеДанные)
	
	Если НачисленияСтрока.КодВыплаты <> "2000" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВычетыСтруктура = Новый Структура;
	ВычетыСтруктура.Вставить("ВычетКод","");
	ВычетыСтруктура.Вставить("ВычетСумма",0);
						
    ВычетПоиск = Новый Структура;
	ВычетПоиск.Вставить("Период",НачисленияСтрока.Период);
	ВычетПоиск.Вставить("Сотрудник",СотрудникСтрока.Сотрудник);
	
	ВычетыМассив = ИсходныеДанные.ВычетыТаблица.НайтиСтроки(ВычетПоиск);
	
	Для каждого ВычетыЭлемент Из ВычетыМассив Цикл
		ВычетыСтруктура.ВычетКод 	= ВычетыЭлемент.ВычетНДФЛ;
		ВычетыСтруктура.ВычетСумма	= ВычетыСтруктура.ВычетСумма + ВычетыЭлемент.СуммаВычетаОборот;
	КонецЦикла;
	
	Возврат ВычетыСтруктура;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
